Tasks/ОшибкиРегламентыхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Task>
		<Properties>
			<Name>ОшибкиРегламентыхЗаданий</Name>
			<Addressing>InformationRegister.СоставГруппПользователей</Addressing>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийКВыполнению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СессияСтатистики</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>ГруппаПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Tasks/ОшибкиРегламентыхЗаданий/Forms/ФормаЗадачи/Ext/Form/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;

	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	Если ТекущийОбъект.Выполнена Тогда
		ЭтаФорма.КомментарийКВыполнению = ПредставлениеКомментария(Объект.КомментарийКВыполнению);
	КонецЕсли;
	Элементы.ГруппаКомментарийКВыполнению.Видимость = ТекущийОбъект.Выполнена;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередВыполнением(Отказ)
	
	Если Не Объект.Выполнена Тогда
	
		Если ВвестиСтроку(Объект.КомментарийКВыполнению, "Введите комментарий к выполнению", , Истина) Тогда
			Если ПустаяСтрока(Объект.КомментарийКВыполнению) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для выполнения задачи необходимо указать комментарий",,,, Отказ);
			КонецЕсли; 
		Иначе
			Отказ = Истина;
		КонецЕсли; 		
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивации()
	
	Если Объект.Выполнена Тогда
		Объект.Выполнена = Ложь;
		Записать();
	КонецЕсли; 
	
КонецПроцедуры	

#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура ДекорацияИзменитьКомментарийНажатие(Элемент)
	
	ИзменитьКомментарий(Неопределено);
		
КонецПроцедуры

&НаКлиенте
Процедура ИсточникОткрытие(Элемент, СтандартнаяОбработка)
	
	Если Объект.Источник = "Журнал регистрации" Тогда
		
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("ДатаНачала", Объект.Дата - 1);
		Если Объект.Выполнена И ЗначениеЗаполнено(Объект.ДатаВыполнения) Тогда
			ПараметрыФормы.Вставить("ДатаОкончания", Объект.ДатаВыполнения + 1);
		КонецЕсли; 
		
		Уровень = Новый СписокЗначений;
		Уровень.Добавить("Ошибка");
		ПараметрыФормы.Вставить("Уровень", Уровень);
		ПараметрыФормы.Вставить("ПредставлениеСобытия", Объект.Наименование);
		ПараметрыФормы.Вставить("Комментарий", Объект.ТекстЗадачи);
		
		ОткрытьФорму("Обработка.ЖурналРегистрации.Форма.ЖурналРегистрации", ПараметрыФормы);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область Команды_формы

&НаКлиенте
Процедура ИзменитьКомментарий(Команда)
	
	Если ВвестиСтроку(Объект.КомментарийКВыполнению, "Введите комментарий к выполнению", , Истина) Тогда
		ЭтаФорма.КомментарийКВыполнению = ПредставлениеКомментария(Объект.КомментарийКВыполнению);
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеКомментария(Знач КомментарийКВыполнению)

	ПредставлениеКомментария = 
		"<HTML><HEAD>
		|<style type=""text/css"">
		|	body {
		|		overflow:    auto;
		|		margin-top:  6px;
		|		margin-left: 10px;
		|		margin-bottom: 0px;
		|		font-family: Arial, sans-serif;
		|		font-size:   10pt;}
		|</style></HEAD>
		|<BODY>ТекстКомментария</BODY></HTML>";
	
	RegExp = Новый COMОбъект("VBScript.RegExp");
	
	RegExp.Global     = Истина;
	RegExp.IgnoreCase = Истина;
	RegExp.MultiLine  = Истина;

	RegExp.Pattern = "#\d{6}";
	Совпадения = RegExp.Execute(КомментарийКВыполнению);
	СоответствиеДляЗамены = Новый Соответствие;
	Ссылка = "<A href=""http://1f.g1.lan/MaintaskForm.aspx?TaskID=НомерЗадачи"">#НомерЗадачи</A>";
	Для Каждого Совпадение Из Совпадения Цикл	
		СоответствиеДляЗамены.Вставить(Совпадение.Value, СтрЗаменить(Ссылка, "НомерЗадачи", Сред(Совпадение.Value, 2)));
	КонецЦикла;
	
	КомментарийКВыполнению = СтрЗаменить(КомментарийКВыполнению, Символы.ПС, Символы.ПС + "<BR>");
	ПредставлениеКомментария = СтрЗаменить(ПредставлениеКомментария, "ТекстКомментария", КомментарийКВыполнению);
		
	Для каждого ЭлементДляЗамены Из СоответствиеДляЗамены Цикл
		ПредставлениеКомментария = СтрЗаменить(ПредставлениеКомментария, ЭлементДляЗамены.Ключ, ЭлементДляЗамены.Значение);
	КонецЦикла; 
	
	Возврат ПредставлениеКомментария;

КонецФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	Если Объект.Выполнена Тогда
		ЭтаФорма.КомментарийКВыполнению = ПредставлениеКомментария(Объект.КомментарийКВыполнению);
	КонецЕсли;
	Элементы.ГруппаКомментарийКВыполнению.Видимость = Объект.Выполнена;
	
	
	Если Объект.Источник = "Журнал регистрации" Тогда
		Элементы.Источник.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.Источник.Гиперссылка = Истина;
		Элементы.Источник.УстановитьДействие("Нажатие", "ИсточникНажатие");
	Иначе
		Элементы.Источник.Вид = ВидПоляФормы.ПолеВвода;
	КонецЕсли;
	
	Элементы.ГиперссылкаПерейтиКСтатистике.Видимость = ЗначениеЗаполнено(Объект.СессияСтатистики);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ДатаНачала", Объект.Дата - 1);
	Если Объект.Выполнена И ЗначениеЗаполнено(Объект.ДатаВыполнения) Тогда
		ПараметрыФормы.Вставить("ДатаОкончания", Объект.ДатаВыполнения + 1);
	КонецЕсли; 
	
	Уровень = Новый СписокЗначений;
	
	Если Объект.Наименование = "Доступ. Отказ в доступе" Тогда
		Уровень.Добавить("Информация");
		Метаданные = Новый СписокЗначений; 
		Метаданные.ЗагрузитьЗначения(СтрРазделить(Объект.ТекстЗадачи, "; ", Ложь));
		ПараметрыФормы.Вставить("Метаданные", Метаданные);
	Иначе
		Уровень.Добавить("Ошибка");
		ПараметрыФормы.Вставить("Комментарий", Объект.ТекстЗадачи);
	КонецЕсли; 
	
	ПараметрыФормы.Вставить("Уровень", Уровень);
	ПараметрыФормы.Вставить("ПредставлениеСобытия", Объект.Наименование);
		
	ОткрытьФорму("Обработка.ЖурналРегистрации.Форма.ЖурналРегистрации", ПараметрыФормы, ЭтаФорма, ЭтаФорма, ЭтаФорма.Окно);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийКВыполнениюПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ДанныеСобытия.Href) Тогда
		ЗапуститьПриложение(ДанныеСобытия.Href);
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаПерейтиКСтатистикеНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Сессия", Объект.СессияСтатистики));
	ОткрытьФорму("РегистрСведений.СтатистикаРаботыВнутреннихМеханизмов.ФормаСписка", ПараметрыФормы, ЭтаФорма, ЭтаФорма, ЭтаФорма.Окно);
	
КонецПроцедуры

#КонецОбласти
